04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/notchedRoller/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 297;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }

    "fluid_to_.*"
    {
        type            coupledTemperature;
        value           $internalField;
    }

    solidFluid_on_nonCoupleRotating
    {
        type            coupledTemperature;
        value           $internalField;
    }

    rollerFluid_on_nonCoupleStationary
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
